[
  {
    "title" : "Singular and Plural Nouns",
    "description" : "A noun names a person, place, thing, or idea.\n Nouns give names of concrete or abstract things in our lives.\n As babies learn 'mom,' 'dad,' or 'milk' as their first word, nouns should be the first topic when you study a foreign language.",
    "example" : "For the plural form of most nouns, add s. \nbottle – bottles \ncup – cups \npencil – pencils \ndesk – desks \nsticker – stickers \nwindow – windows \nFor nouns that end in ch, x, s, or s sounds, add es. \nbox – boxes \nwatch – watches \nmoss – mosses \nbus – buses \nFor nouns ending in f or fe, change f to v and add es. \nwolf – wolves \nwife – wives \nleaf – leaves \nlife – lives \nSome nouns have different plural forms. \nchild – children \nwoman – women \nman – men \nmouse – mice \ngoose – geese \nNouns ending in vowels like y or o do not have definite rules. \nbaby – babies \ntoy – toys \nkidney – kidneys \npotato – potatoes \nmemo – memos \nstereo – stereos \nA few nouns have the same singular and plural forms. \nsheep – sheep \ndeer – deer \nseries – series \nspecies – species"
  },

  {
    "title" : "Count Nouns vs. Non-Count Nouns",
    "description" : "Count nouns \nCan be counted as one or more.  \nNon-count nouns \nCannot be counted. They usually express a group or a type. ",
    "example" : "Count nouns: \npen, computer, bottle, spoon, desk, cup, television, chair, shoe, finger, flower, camera, stick, balloon, book, table, comb, etc. \nTake an s to form the plural. \npens, computers, bottles, spoons, desks, cups, televisions, chairs, shoes, fingers, flowers, cameras, sticks, balloons, books, tables, combs, etc. \nWork with expressions such as (a few, few, many, some, every, each, these, and the number of). \na few pens, a few computers, many bottles, some spoons, every desk, each cup, these televisions, the number of chairs, a few shoes, a few fingers, many flowers, some cameras, every stick, each balloon, these books, the number of tables, many combs, etc. \nWork with appropriate articles (a, an, or the). \na pen, the computer, a bottle, the spoon, a desk, the cup, a television, the chair, a shoe, the finger, a flower, the camera, a stick, the balloon, a book, the table, a comb, etc. \n Non Count nouns : \nwater, wood, ice, air, oxygen, English, Spanish, traffic, furniture, milk, wine, sugar, rice, meat, flour, soccer, sunshine, etc. \nGenerally cannot be pluralized. \nWork both with and without an article (a, an, or the), depending on the context of the sentence. \nSugar is sweet. \nThe sunshine is beautiful. \nI drink milk. \nHe eats rice. \nWe watch soccer together. \nThe wood is burning. \nWork with expressions such as (some, any, enough, this, that, and much). \nWe ate some rice and milk. \nI hope to see some sunshine today. \nThis meat is good. \nShe does not speak much Spanish. \nDo you see any traffic on the road? \nThat wine is very old."
  },

  {
    "title": "Possessive Nouns",
    "description": "Possessive nouns are used to indicate ownership.",
    "example": "Possessive nouns usually are formed by adding an apostrophe (') and s.\nJohn's book\nKerry's car\nGrandma's mirror\nWhen a noun is plural and ends in s, just add an apostrophe (').\nThe kids' toys\nMy parents' house\nThe teachers' lounge\nIf two people own one thing, add the apostrophe and s to the second person only.\nJohn and Mary's new house\nDavid and Sue's wedding\nTom and Doug's car\nIf two people own separate things, add the apostrophe and s for each person.\nSusan's and Beth's books\nJean's and Dan's pants\nBen's and Jim's offices"
  },

  {
    "title": "Pronouns",
    "description": "A pronoun takes the place of a noun.A pronoun is defined as a word or phrase that is used as a substitution for a noun or noun phrase, which is known as the pronoun’s antecedent. Pronouns are short words and can do everything that nouns can do and are one of the building blocks of a sentence.A pronoun can act as a subject, direct object, indirect object, object of the preposition, and more and takes the place of any person, place, animal or thing.\nPronouns can be divided into numerous categories including:\nIndefinite pronouns – those referring to one or more unspecified objects, beings, or places, such as someone, anybody, nothing.\n1. Anyone 2. Somebody 3. Whichever 4. Whoever 5. Other 6. Something 7. Nobody\nPersonal pronouns – those associated with a certain person, thing, or group; all except you have distinct forms that indicate singular or plural number. Personal pronouns are always specific and are often used to replace a proper noun (someone’s name) or a collective group of people or things.\nIt is used to replace the subject of the sentence: I, you, he, she, it, we, you and they. Notice that you is repeated as you can be singular, addressing one person, or plural, addressing a group of people.\nReflexive pronouns – those preceded by the adverb, adjective, pronoun, or noun to which they refer, and ending in –self or –selves. Reflexive pronouns are used to refer back to the subject or clause of a sentence. The list of reflexive pronouns includes: Myself, yourself, himself, herself, itself, ourselves, yourselves, themselves.\nDemonstrative pronouns – those used to point to something specific within a sentence. There are only four demonstrative pronouns – this, that, these, those – but the usage can be a bit tricky at times. This and that are singular, whereas these and those are plural.\nPossessive pronouns – those designating possession or ownership. Examples include: mine, its, hers, his, yours, ours, theirs, whose.\nRelative pronouns –those which refer to nouns mentioned previously, acting to introduce an adjective (relative) clause. They will usually appear after a noun to help clarify the sentence or give extra information.",
    "example": "Indefinite pronouns\nWould anyone like a coffee? Take whatever you like. \nJamie took one cookie and Ben took the other.\nPersonal pronouns\nJack and David are friends. \nThey play basketball together. \nI have more money than he We will be late if you don’t hurry up.\nPossessive pronouns\nAre these bananas yours? \nThis money is ours."
  },

  {
    "title": "Verbs",
    "description": "A verb shows action or a state of being.\n'Be' Verbs:\n'Be' verbs indicate a state of being.Verbs must match subjects.Negative sentences need ‘not' after the verb.The verb comes first in interrogative sentences.\nAction Verbs:\nAction verbs express action and are the most common verbs.\nAction verbs need s at the end with third-person, singular subjects.",
    "example": "'Be' verbs:\nI am a doctor.\nI am not a doctor.\nAm I a doctor?\nAction Verbs:\nHe eats bread.\nI do not eat bread.\nDo you eat bread?"
  },
  {
    "title": "Adjectives",
    "description": "Adjectives describe or modify nouns.Adjectives generally appear immediately before the noun.\nCommonly, adjectives of opposite meaning are formed by adding a prefix such as un, in, or dis.\nThe + adjective describes a class or group of people and acts as a noun.",
    "example": "A pretty girl,\nA big brown house.\nA small old English desk.\nA beautiful black Italian leather purse\nThis popular TV show is loved by the old."
  },
  {
    "title": "Adverbs",
    "description": "Adverbs modify a verb, an adjective, or another adverb.\nAn adverb tells more about a verb in the sentence.",
    "example": "The fire engine runs fast.\nListen to his speech carefully.\nI browse the web frequently.\nIt rained hard.\nAn adverb describes more about an adjective in the sentence.\nThe news is very surprising!\nThe coffee is extremely hot, so be careful.\nNature is really amazing!\nAn adverb modifies another adverb in the sentence.\nIt rains very hard.\nComputers run much faster these days.\nI clean my room less frequently because I am busy.\nCommonly, adjectives can be changed to adverbs by adding 'ly'.\nslow – slowly\nquick – quickly\ncomfortable – comfortably\nloud – loudly\nclear – clearly\nTo change adjectives ending in 'y' into adverbs, change the 'y' to 'i' and add 'ly'.\nhappy – happily\neasy – easily"
  },
  {
    "title": "Simple Tense",
    "description": "Verb tense tells you when the action happens. There are three main verb tenses: present, past, and future. Each main tense is divided into simple, progressive, perfect, and perfect progressive tenses.Things to remember about simple tense:\na. Present tense is the original verb form.\nb. Past tense has a few patterns.\nc. Future tense needs will (shall) + verb.",
    "example": "run\nI run a marathon twice a year. (present)\nI ran a marathon last year. (past)\nI will run a marathon next year. (future)\neat\nI eat lunch in my office.\nI ate lunch an hour ago.\nI will eat lunch in one hour.\nsee\nI see a movie once a week.\nI saw a movie yesterday.\nI will see a movie tomorrow."
  },
  {
    "title": "Active Voice and Passive Voice",
    "description": "Verbs are either active or passive in voice. In the active voice, the subject and verb relationship is straightforward: the subject is a do-er. In the passive voice, the subject of the sentence is not a do-er. It is shown with by + do-er or is not shown in the sentence.\nPassive voice is used when the action is the focus, not the subject. It is not important (or not known) who does the action.",
    "example": "The window is broken. (It is not known who broke the window, or it is not important to know who broke the window.)\nThe class has been canceled. (The focus is on the class being canceled. It is not important to know who canceled it.)\nPassive voice should be avoided when you want more clarity in writing. However, in some cases, you need to use passive voice to stress the action, not the actor. Also, passive voice can be considered more polite, as it sounds less aggressive or dramatic.\nThat building was built in 1990.\nThe car was invented about a hundred years ago.\nYou can easily rewrite an active sentence to a passive sentence. The object in the active sentence becomes a subject in the passive sentence. The verb is changed to a “be” verb + past participle. The subject of the active sentence follows by or is omitted.\nSam wrote a letter to Jamie.\nA letter was written to Jamie by Sam.\nThe government built a new bridge.\nA new bridge was built by the government."
  },
  {
    "title": "Preposition",
    "description": "A preposition is a word that links a noun, pronoun, or noun phrase to some other part of the sentence.\nPrepositions can be tricky for English learners. There is no definite rule or formula for choosing a preposition. In the beginning stage of learning the language, you should try to identify a preposition when reading or listening in English and recognize its usage.\nA preposition is used to show direction, location, or time, or to introduce an object.",
    "example": "On:\nI put an egg on the kitchen table.\nThe garbage truck comes on Wednesdays.\nAt:\nI will meet you at 12 p.m.\nThere is a party at the club house.\nIn:\nShe always reads newspapers in the morning.\nShe looked me directly in the eyes.\nOf:\nThe secret of this game is that you can’t ever win.\nThe highlight of the show is at the end.\nTo:\nI am heading to the entrance of the building.\nThe package was mailed to Mr. Kim yesterday.\nFor:\nThis place is for exhibitions and shows.\nI baked a cake for your birthday."
  }
]